# ************************************************************
# デバッグ用のユーティリティ関数を提供するモジュール
# ************************************************************

# 標準ライブラリのインポート
import datetime
from config import _config

# 日付フォーマットの設定
DATE_FORMAT = "%Y-%m-%d %H:%M:%S"
APP_MODE = _config.get("app-mode", "debug")


# ============================================================
# 設定フォーマットに基づいたタイムスタンプ出力関数
# ============================================================
def get_timestamp():
    """
    現在のタイムスタンプを設定フォーマットで取得する関数

    戻り値:
    現在のタイムスタンプ（文字列）
    """
    return datetime.datetime.now().strftime(DATE_FORMAT)


# ============================================================
# ログ出力用の関数
# ※内容はコンソール表示と同じ
# ============================================================
def log_print(message):
    """
    ログ用にメッセージを出力する関数

    引数:
    message: 出力するメッセージ

    戻り値: なし
    """
    from .filer import write_file

    log_file_path = "app.log"
    write_file(
        log_file_path,
        f"[LOG] {get_timestamp()} {message}\n",
        append=True
    )

    # アプリのモードが "debug" の場合のみデバッグメッセージを出力する
    if APP_MODE == "debug":
        print(f"[DEBUG] {get_timestamp()} {message}")


# ============================================================
# デバッグ用の関数（アプリがデバッグモードの場合のみ有効）
# ============================================================
if APP_MODE == "debug":
    def debug_print(message):
        """
        デバッグ用にメッセージを出力する関数

        引数:
        message: 出力するメッセージ

        戻り値: なし
        """

        print(f"[DEBUG] {get_timestamp()} {message}")
